WITH cte_days(missing_date) -- создаем временную результирующую таблицу для последующих итераций
AS (
    SELECT DISTINCT person_visits.visit_date AS missing_date
    FROM person_visits -- собираем все уникальные (без дубликатов) данные визитов из таблицы визиты_персон
)
SELECT missing_date -- основной запрос
FROM cte_days -- из созданной временной таблицы
LEFT JOIN ( -- лефт джойн, чтобы сопоставить даты из CTE с датами визитов персон с ид 1 и 2
    SELECT visit_date -- подзапрос - извлекаем даты визитов только по персонам с ид 1 и 2
    FROM person_visits
    WHERE person_id = 1 OR person_id = 2
) AS temp -- временная таблица
ON missing_date = temp.visit_date -- условие объединения, соединим даты из СТЕ с датами из подзапроса по визит_дейт
WHERE temp.visit_date is NULL -- и отфильтруем результат, оставим только те даты из СТЕ, для которых не нашлось совпадений в подзапросе, это есть даты, когда персоны с ид 1 и 2 не совершали визитов
ORDER BY missing_date; -- сортировка результата по возрастанию
/*аналогично 01, запрос для нахождения дат из таблицы
визиты персон в которые не было визитов людей и ид 1 и 2*/
-- CTE (Common Table Expression) - временнная результирующая таблица, создаваемая в рамках одного SQL запроса, для улучшения читаемости кода, для повторго использования результатов промежуточных вычислений в одном запросе и  рекурсивных запросов используется с WITH