SELECT COALESCE(person.name, '-') AS person_name, -- выбираем имя человека из таблицы персон, если данные отсутствуют/значение не определено, то меняем посредством коалес на прочерк, присваиваем псевдоним таблице
    visit_date, -- выбираем дату посещения, здесь мы не используем COALESCE т.к. при отстутствии данных так и должно выводить NULL
    COALESCE(pizzeria.name, '-') AS pizzeria_name -- выбираем название пиццерии, аналогично при нулл меняем на прочерк, задаем название таблице для вывода
FROM ( -- из данного подзапроса будем выводить вышеуказанное
    SELECT person_id, pizzeria_id, visit_date FROM person_visits -- а здесь мы выбираем данные по указанным столбцам из указанной таблицы
    WHERE visit_date BETWEEN '2022-01-01' AND '2022-01-03' -- фильтруем эти данные по указанным датам
     ) AS temp -- создаем временную таблицу
FULL JOIN person ON temp.person_id = person.id -- делаем полное объединение с таблицей персон по ид человека
FULL JOIN pizzeria ON temp.pizzeria_id = pizzeria.id -- полное объединение с таблией пиццерия по ид пиццерии
ORDER BY person_name, visit_date, pizzeria_name; -- сортируем по имени человека, дате и названию пиццерии
/*для вывода полного списка имен людей, которые постеили или не
посетили пиццерии с 01 по 03.09.2022 и список названий пиццерий
которые были или не были посещены. Принцип действия - сначала
выполняется подзапрос собирающий нужно инфу в указанные даты, затем
происходит полное объединение реузльтатов подзароса с указанными
таблицами, после этого происходит вывод данных, где NULL заменены на прочерк,
а завершает все сортировка*/
-- COALESCE функция для возврата первого ненулевого значения или вывода прочерка
-- full join on полностью объединяет таблицы по заданным условиям, включая как совпадающие, так и несовпадающие строки, а там, где совпадений нет отображается NULL 