SELECT first_person.name AS person_name1, -- отбираем поле имена из первой копии таблицы персон, присваиваем имя
    second_person.name AS person_name2, -- отбираем имена из второй копии таблицы, аналогично присваиваем имя
    first_person.address AS common_address -- отбираем адрес из первой копии...
FROM person AS first_person -- делаем первую копию таблицы персон и определяем ее как первая персон
CROSS JOIN person AS second_person -- а здесь делаем вторую копию таблицы персон, а затем делаем декартово произведение первой и второй копий
WHERE first_person.name != second_person.name -- сразу исключаем пары с одинакомыми именами
      AND first_person.address = second_person.address -- отфильтровыеваем пары, живущие по одному адресу
      AND first_person.id > second_person.id -- убираем дублирующие комбинации, типа пара Анна-Андрей - Андрей-Анна - чтобы, вторая пара не появлялась
ORDER BY person_name1, person_name2, common_address; -- сортируем по возрастанию по указанными критериям
/*выводит имена людей, живущих по одному адресу*/
-- cross join нужен для декартова произведения двух таблиц
-- то есть он создает таблицу содержащую все возможные комбинации
-- строк из двух исходных таблиц