SELECT person.name -- выбираем поле имя из таблицы персоны
FROM person -- работаем с основной таблицей
JOIN ( -- первый подзапрос выбирает тех женщин, которые заказали пиццу пеперрони
       SELECT person.name -- выбираем/вводим поле имена из таблицы персон
       FROM person_order -- работаем с таблицей заказы персон
       JOIN person ON person_order.person_id = person.id -- соединяем таблицу заказы персон с персон по ид персон, получаем имен людей
       JOIN menu ON person_order.menu_id = menu.id -- соединяем таблицу заказы персон с меню по ид меню, получаем список пицц
       WHERE gender = 'female' AND pizza_name = 'pepperoni pizza' -- фильтруем по полу и заказу пепперони пицца
     ) AS pepperoni -- это будет наша первая временная таблица с названием пепперони
ON person.name = pepperoni.name -- соединяем результат основного запрос с результатом подзапроса пепперони и получаем списко только тех женщин, что заказали пепперони
JOIN ( -- второй запрос
       SELECT person.name -- выбираем/выводим имена персон
       FROM person_order -- работаем с таблицей заказы персон
       JOIN person ON person_order.person_id = person.id -- соединяем заказы персон с таблицей персоны по ид персон, получаем имена
       JOIN menu ON person_order.menu_id = menu.id -- аналогично соединяем заказы персон с меню по меню ид, получаем названия пицц
       WHERE gender = 'female' AND pizza_name = 'cheese pizza' -- фильтруем их по полу и названию сырная пицца
     ) AS cheese -- получаем вторую временную таблицу, с девушками, что заказывали сырную пиццу
ON person.name = cheese.name -- соединяем по именам полученный ранее результат с текущим подзапросом на основе совпадений и получаем девушке, что заказали и пепперони, и сырную
ORDER BY person.name; -- фильтруем по возрастанию
/*найдем всех девчуль, что 
заказали и сырную пиццу, и пепперони*/
/*основной запрос используем результаты подзапросов
пепперони и сырная пицца, сначала он соединит таблицу персоны
с подзапросом пепперони на основе сопадения имен, а затем уже
соединит полученный результат с подзапросом сырная пица снова на
основе сопадения имен. В итоговом результате и останутся имена
только тех женщин, что заказали обе пиццы*/
