SELECT person.name -- выбирем поле нейм из таблицы персоны, присваивать псевдоним выводимом столбцу не нужно!
FROM person_order -- основаня таблица с которой будет запрос
JOIN person ON person_order.person_id = person.id -- соединим таблицу заказы_персон с таблицей персоны, чтобы получить имена людей
JOIN menu ON person_order.menu_id = menu.id -- соединяем закары персон с таблицей меню по ид меню, получаем список пицц
WHERE gender = 'male' -- начинаем фильтровать по полу
AND address IN ('Moscow', 'Samara') -- и по адресу
AND pizza_name IN ('pepperoni pizza', 'mushroom pizza') -- и по имени названию пиццы
ORDER BY name DESC; -- сортируем имена по убыванию
/*найдем тех парней, что заказывали или пепперони или
грибную пиццу в Москве или в Самаре, вывод в порядке
убывания*/
