SELECT temp.pizza_name, -- выбор названия пиццы из временной таблицы
    pizzeria.name AS pizzeria_name, -- выбор названия пиццерии где продается нужная нам пицца, задаем название таблицы
    temp.price -- выбор цены пиццы
FROM ( -- это будет из подзапроса, сформировавшего временную таблицу
    SELECT pizzeria_id, pizza_name, price -- вложенный запрос, выбор ид пиццерии, названия пиццы и цену
    FROM menu -- из таблицы меню
    WHERE pizza_name = 'mushroom pizza' OR -- фильтр по 2-м указанным названиям пицц
        pizza_name = 'pepperoni pizza'
) AS temp -- временная таблица
JOIN pizzeria ON temp.pizzeria_id = pizzeria.id -- соединение временной таблици с таблией пиццерии по ид пиццерии
ORDER BY pizza_name, pizzeria_name; -- сортирование по возрастанию по имени пиццы и названию пиццерии
/*запрос для поиска пицц с имененм "грибная пицца" и 
"пепперони пицца" в меню, и для поиска информации о пиццериях,
где и по какой цене они продаются. Сорировка по названию пиццы
и пиццерии*/
-- сначала подзапрос - поиск на названиям грибная и пепперони и извлечение для них указанных данных
-- основной запрос который объединяет результат вложенного запроса с таблицей пиццерия и сортировка результатов
-- join on (это inner join on по умолчанию) - вернет только те строки, где есть совпадения по указанным в on столбцам