SELECT name, rating -- выбираем столбцы с названием и рейтингом пиццерии
FROM pizzeria -- из таблицы пиццерия
LEFT JOIN person_visits -- делаем левое соединение пиццерии с таблицей визиты_персон по полю пиццерия_ид
ON person_visits.pizzeria_id = pizzeria.id -- связываем соединение с полем ид из таблицы пиццерия
WHERE person_visits.pizzeria_id is NULL -- ГДЕ оставлены и выведены будут только те строки, по которым в пиццерия ид не было найдено соответствий
/*чтобы получить списко пиццерий, которые никто не посещал*/
/*left join on - тип соединения, при котором происходит
возврат всех строк левой таблицы (которая указана до left join)
и соответствующих строк из правой таблицы (после left join). ON - ключевое слово,
определяет условие объединения - т.е. те критерии по которым строки
будут сопоставляться. Здесь он нужен для того, чтобы при
объединение не потерять строки из основной (левой таблицы),
даже если в правой нет совпадений*/