SELECT DISTINCT person_visits.visit_date AS missing_date -- выбираем уникальные даты посещений (дистинкт - чтобы убрать дубликаты) и присваиваем им название пропущенные_даты
FROM person_visits -- из таблицы визиты персон
LEFT JOIN ( -- при этом вложенный запрос создает временную таблицу, в которую собирает даты посещений для людей с ид 1 и 2
    SELECT visit_date FROM person_visits
    WHERE person_id = 1 OR person_id = 2
) AS temp
ON person_visits.visit_date = temp.visit_date -- происходит левое соединение основной таблицы с временной по дате посещения
WHERE temp.visit_date is NULL -- где оставляем только те даты, которых нет во временной таблице - это и есть отсутствущие дни для персон с ид 1 и 2
ORDER BY missing_date; -- сортируем результат по возрастанию
/*запрос для поиска уникальных дат из таблицы визиты_персон,
которые отсутствуют для людей с ид 1 и 2, т.е. пропущенные ими
дни и сортирует их по возрастанию*/